<a href="https://colab.research.google.com/github/mehrdadkazemi254/MachineLearning/blob/main/Pandas_Indexing_Selecting_Assigning.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [7]:
import pandas as pd
data = pd.read_csv('/content/sample_data/california_housing_train.csv')
data.head()

   longitude  latitude  ...  median_income  median_house_value
0    -114.31     34.19  ...         1.4936             66900.0
1    -114.47     34.40  ...         1.8200             80100.0
2    -114.56     33.69  ...         1.6509             85700.0
3    -114.57     33.64  ...         3.1917             73400.0
4    -114.57     33.57  ...         1.9250             65500.0

[5 rows x 9 columns]

In [10]:
data.longitude

0       -114.31
1       -114.47
2       -114.56
3       -114.57
4       -114.57
          ...
16995   -124.26
16996   -124.27
16997   -124.30
16998   -124.30
16999   -124.35
Name: longitude, Length: 17000, dtype: float64

In [11]:
data['longitude']

0       -114.31
1       -114.47
2       -114.56
3       -114.57
4       -114.57
          ...
16995   -124.26
16996   -124.27
16997   -124.30
16998   -124.30
16999   -124.35
Name: longitude, Length: 17000, dtype: float64

In [74]:
data.longitude[0]

-114.31

In [14]:
data['longitude'][0]

-114.31

In [15]:
data['longitude'][:3]

0   -114.31
1   -114.47
2   -114.56
Name: longitude, dtype: float64

**Indexing specific for Pandas:**


1.   iloc (index-based selection)
2.   loc (label-based selection)

*AS OPPOSED TO NATIVE PYTHON, THESE ARE BOTH ROW FIRST, COLUMN SECOND.*
## **iloc**

In [21]:
data.iloc[0]

longitude              -114.3100
latitude                 34.1900
housing_median_age       15.0000
total_rooms            5612.0000
total_bedrooms         1283.0000
population             1015.0000
households              472.0000
median_income             1.4936
median_house_value    66900.0000
Name: 0, dtype: float64

In [17]:
data.iloc[0:2]

   longitude  latitude  ...  median_income  median_house_value
0    -114.31     34.19  ...         1.4936             66900.0
1    -114.47     34.40  ...         1.8200             80100.0

[2 rows x 9 columns]

In [22]:
#to get the first column
data.iloc[:,0]

0       -114.31
1       -114.47
2       -114.56
3       -114.57
4       -114.57
          ...
16995   -124.26
16996   -124.27
16997   -124.30
16998   -124.30
16999   -124.35
Name: longitude, Length: 17000, dtype: float64

In [26]:
#column 1, first three rows
data.iloc[:4,0]

0   -114.31
1   -114.47
2   -114.56
3   -114.57
Name: longitude, dtype: float64

In [25]:
#you can also pass a list
data.iloc[[0,1,3],0]

0   -114.31
1   -114.47
3   -114.57
Name: longitude, dtype: float64

In [29]:
data.iloc[-2:,0]

16998   -124.30
16999   -124.35
Name: longitude, dtype: float64

In [30]:
data.iloc[-2:]

       longitude  latitude  ...  median_income  median_house_value
16998    -124.30     41.80  ...         1.9797             85800.0
16999    -124.35     40.54  ...         3.0147             94600.0

[2 rows x 9 columns]

## **loc**

In [35]:
data.loc[16998,'median_income']

1.9797

"iloc uses the Python stdlib indexing scheme, where the first element of the range is included and the last one excluded. So 0:10 will select entries 0,...,9. loc, meanwhile, indexes inclusively. So 0:10 will select entries 0,...,10."

https://www.kaggle.com/residentmario/indexing-selecting-assigning

In [37]:
data.set_index('median_income')

               longitude  latitude  ...  households  median_house_value
median_income                       ...
1.4936           -114.31     34.19  ...       472.0             66900.0
1.8200           -114.47     34.40  ...       463.0             80100.0
1.6509           -114.56     33.69  ...       117.0             85700.0
3.1917           -114.57     33.64  ...       226.0             73400.0
1.9250           -114.57     33.57  ...       262.0             65500.0
...                  ...       ...  ...         ...                 ...
2.3571           -124.26     40.58  ...       369.0            111400.0
2.5179           -124.27     40.69  ...       465.0             79000.0
3.0313           -124.30     41.84  ...       456.0            103600.0
1.9797           -124.30     41.80  ...       478.0             85800.0
3.0147           -124.35     40.54  ...       270.0             94600.0

[17000 rows x 8 columns]

In [42]:
data.loc[data.median_income >= 3]

       longitude  latitude  ...  median_income  median_house_value
3        -114.57     33.64  ...         3.1917             73400.0
5        -114.58     33.63  ...         3.3438             74000.0
13       -114.61     34.83  ...         3.2120             70400.0
23       -114.98     33.82  ...         3.2097             71300.0
25       -115.32     32.82  ...         3.6528            100000.0
...          ...       ...  ...            ...                 ...
16986    -124.19     40.73  ...         3.5363             90100.0
16992    -124.23     40.81  ...         3.3462             50800.0
16993    -124.23     40.54  ...         3.0806            106700.0
16997    -124.30     41.84  ...         3.0313            103600.0
16999    -124.35     40.54  ...         3.0147             94600.0

[10954 rows x 9 columns]

& : AND

| : OR

In [47]:
data.loc[(data.housing_median_age == 4) & (data.population >= 10**4)]

       longitude  latitude  ...  median_income  median_house_value
1116     -117.12     33.52  ...         4.5841            212300.0
2871     -117.74     33.89  ...         7.4947            366300.0
2897     -117.75     34.01  ...         6.1287            289600.0
4771     -118.09     34.68  ...         4.0211            144000.0
12018    -121.40     38.47  ...         4.3658            130600.0

[5 rows x 9 columns]

In [48]:
data.loc[(data.population >=10000) | (data.latitude >= 38)]

       longitude  latitude  ...  median_income  median_house_value
1116     -117.12     33.52  ...         4.5841            212300.0
2274     -117.42     33.35  ...         2.5729            134400.0
2464     -117.61     34.10  ...         3.6033            132600.0
2871     -117.74     33.89  ...         7.4947            366300.0
2897     -117.75     34.01  ...         6.1287            289600.0
...          ...       ...  ...            ...                 ...
16995    -124.26     40.58  ...         2.3571            111400.0
16996    -124.27     40.69  ...         2.5179             79000.0
16997    -124.30     41.84  ...         3.0313            103600.0
16998    -124.30     41.80  ...         1.9797             85800.0
16999    -124.35     40.54  ...         3.0147             94600.0

[2564 rows x 9 columns]

# **isin**
.isin([ ])

In [52]:
data.loc[data.housing_median_age.isin([16,17,18])]

       longitude  latitude  ...  median_income  median_house_value
2        -114.56     33.69  ...         1.6509             85700.0
10       -114.60     33.62  ...         2.6797             86500.0
15       -114.65     34.89  ...         1.6991             69100.0
18       -114.66     32.74  ...         1.2049             44000.0
19       -114.67     33.92  ...         1.2656             27500.0
...          ...       ...  ...            ...                 ...
16930    -124.11     40.93  ...         2.7639             90200.0
16946    -124.14     40.59  ...         2.1780             76800.0
16949    -124.15     41.81  ...         2.2868            103100.0
16987    -124.21     41.77  ...         2.5795             68400.0
16997    -124.30     41.84  ...         3.0313            103600.0

[1689 rows x 9 columns]

# **isnull**
## **notnull**

In [60]:
print(data.columns.isnull())
print(data.columns.notnull())

[False False False False False False False False False]
[ True  True  True  True  True  True  True  True  True]

In [61]:
data.loc[data.population.isnull()]

Empty DataFrame
Columns: [longitude, latitude, housing_median_age, total_rooms, total_bedrooms, population, households, median_income, median_house_value]
Index: []

In [68]:
data['population'] = 0
data['population']

0        0
1        0
2        0
3        0
4        0
        ..
16995    0
16996    0
16997    0
16998    0
16999    0
Name: population, Length: 17000, dtype: int64

In [73]:
data['population'] = range(len(data),0,-1)
data['population']

0        17000
1        16999
2        16998
3        16997
4        16996
         ...
16995        5
16996        4
16997        3
16998        2
16999        1
Name: population, Length: 17000, dtype: int64